#include "tasks.h"

/*	Task 01. The Leap Year [високосный год]
 *
 *	Определите, является ли заданный год високосным
 *	(как нашей эры, так и до нашей эры).
 *
 *	Примечание
 *	1) Год является високосным, если его номер кратен 4,
 *	но не кратен 100, или если он кратен 400.
 *	2) Можно попробовать реализовать алгоритм в одно условное выражение.
 *
 *	Формат входных данных [input]
 *	На вход функция получает целое число типа int.
 *
 *	Формат выходных данных [output]
 *	Функция должна возвратить результат в виде булевского значения.
 *
 *	[ input 1]: 2023
 *	[output 1]: false
 *
 *	[ input 2]: 1984
 *	[output 2]: true
 *
 *	[ input 3]: 2000
 *	[output 3]: true
 *
 *	[ input 4]: 0
 *	[output 4]: true
 *
 *	[ input 5]: -100
 *	[output 5]: false
 */

bool task01(int year) {
	return (year % 400 == 0) || ((year % 4 == 0) && (year % 100 != 0));
}